resources-ms/myapp/app/models/course_has_resource_serializer.rb

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
  def course_name
  	Course.find(object.course_id).name

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 49], ["LIMIT", 1]]
---
  def resource_name
  	Resource.find(object.resource_id).name