resources-ms/myapp/app/models/teacher_has_resource_serializer.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def teacher_name
  	Teacher.find(object.teacher_id).name

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def teacher_description
  	Teacher.find(object.teacher_id).description

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
---
  def resource_name
  	Resource.find(object.resource_id).name