Yesid/app/controllers/resources_controller.rb

  def index
    #@resources = Resource.all
    #render json: @resources
    @resources = Resource.paginate(:page => params[:page], per_page:6).order(created_at: :desc)
---
SELECT  "resources".* FROM "resources" ORDER BY "resources"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 6]]

  def create
    @resource = Resource.new(resource_params)

    if @resource.save
---
INSERT INTO "resources" ("name", "link", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "diego la succiona v3.0"], ["link", "oaoasodaodoasd"], ["description", "lalalalala"], ["created_at", "2018-09-28 20:48:50.564379"], ["updated_at", "2018-09-28 20:48:50.564379"]]

  def update
    if @resource.update(resource_params)
---
UPDATE "resources" SET "updated_at" = ? WHERE "resources"."id" = ?  [["updated_at", "2018-09-28 23:26:10.566844"], ["id", 1]]

  def destroy
    @resource.destroy
---
DELETE FROM "resources" WHERE "resources"."id" = ?  [["id", 2]]