resources-ms/myapp/app/serializers/course_has_resource_serializer.rb

  def course_name
  	Course.find(object.course_id).name
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def course_description
  	Course.find(object.course_id).description
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def course_code
  	Course.find(object.course_id).code
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def resource_name
  	Resource.find(object.resource_id).name
---
SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]

  def resource_description
  	Resource.find(object.resource_id).description
---
SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]

  def resource_link
  	Resource.find(object.resource_id).link
---
SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 48], ["LIMIT", 1]]