resources-ms/myapp/app/serializers/teacher_has_course_serializer.rb

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def teacher_name
  	Teacher.find(object.teacher_id).name

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def teacher_description
  	Teacher.find(object.teacher_id).description

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def course_name
  	Course.find(object.course_id).name

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def course_description
  	Course.find(object.course_id).description

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def course_code
  	Course.find(object.course_id).code