resources-ms/myapp/app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses" LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 0]]
---
  def index
    #@courses = Course.all
    #render json: @courses
    @courses = Course.paginate(:page => params[:page], per_page:6)