resources-ms/myapp/app/controllers/resources_controller.rb

SELECT  "resources".* FROM "resources" ORDER BY "resources"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 6]]
---
  def index
    #@resources = Resource.all
    #render json: @resources
    @resources = Resource.paginate(:page => params[:page], per_page:6).order(created_at: :desc)

INSERT INTO "resources" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "nombre del archivo"], ["description", "descripcion"], ["created_at", "2018-09-28 23:15:33.571470"], ["updated_at", "2018-09-28 23:15:33.571470"]]
INSERT INTO "resources" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "nombre del archivo"], ["description", "descripcion"], ["created_at", "2018-09-28 21:04:00.379711"], ["updated_at", "2018-09-28 21:04:00.379711"]]
UPDATE "resources" SET "updated_at" = ? WHERE "resources"."id" = ?  [["updated_at", "2018-09-28 21:04:00.387562"], ["id", 55]]
---
  def create
    resource = Resource.create(name: params[:name],description: params[:description], link: params[:link])
    if resource.save

UPDATE "resources" SET "updated_at" = ? WHERE "resources"."id" = ?  [["updated_at", "2018-09-28 23:26:10.566844"], ["id", 1]]
---
  def update
    if @resource.update(name: params[:name],description: params[:description], link: params[:link])

DELETE FROM "resources" WHERE "resources"."id" = ?  [["id", 2]]
---
  def destroy
    @resource.destroy