resources-ms/myapp/app/controllers/teachers_controller.rb

  def index
    #@teachers = Teacher.all
    #render json: @teachers
    @teachers = Teacher.paginate(:page => params[:page], per_page:6)
---
SELECT  "teachers".* FROM "teachers" LIMIT ? OFFSET ?  [["LIMIT", 6], ["OFFSET", 6]]